# PROJECT 3 PART 2
NOKUTHULA MCHUNU

I) Normalizing Genres - Overview

In order to normalize genres, we will need to:

Convert the single string of genres from title basics into 2 new tables.
title_genres: with the columns:

tconst
genre_id
genres:

genre_id
genre_name
Creating these tables will be a multi-step process.

Getting a list of all individual genres.
Create a new title_genres table with with the movie ids duplicated, once for each genre that a movie belongs to.
Create a mapper dictionary with numeric ids for each genre.
Use the mapper dictionary to replace the string genres in title_genres with numeric genre_ids.
Convert the mapper dictionary into a final genres table with the numeric genre_id and the string genre.

In [48]:
# Import relevent liberies 
import pandas as pd 
import numpy as ny

In [49]:
# Loading basic-rating
basic = pd.read_csv('Data/title_basics.csv.gz')
basic.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016,NaN,90,Drama
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
4,tt0070596,movie,Socialist Realism,El realismo socialista,0,2023,NaN,78,Drama

##1. Getting a List of Unique Genres

In [50]:
## create a col with a list of genres
basic['genres_split'] = basic['genres'].str.split(',')
basic['genres_split']

0           [Comedy, Fantasy, Romance]
1                              [Drama]
2                              [Drama]
3                              [Drama]
4                              [Drama]
                     ...
91448                          [Drama]
91449         [Comedy, Drama, Fantasy]
91450                          [Drama]
91451    [Action, Adventure, Thriller]
91452                 [Drama, History]
Name: genres_split, Length: 91453, dtype: object

We will then use .explode() to separate the list of genres into new rows: one row for each genre a movie belonged to.

In [51]:
#Use explode function
exploded_genres = basic.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama,Drama
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016,NaN,90,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
91451,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Action
91451,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Adventure
91451,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Thriller
91452,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",Drama
91452,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",History

In [52]:
unique_genres = sorted(exploded_genres['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

## 2. Create a new title_genres table

In [53]:
# Creating a new table from Genres
title_genres = exploded_genres[['tconst','genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0068865        Drama

## 3. Create a genre mapper dictionary to replace string genres with integers

In [54]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

In [55]:
genre_id_map = dict(zip(unique_genres,range(len(unique_genres))))
genre_id_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

## 4. Replace the string genres in title_genres with the new integer ids.

In [56]:
## make new integer genre_id and drop string genres
#basic['genre_id'] = basic['genres_split'].map(genre_map)
genre_ints

range(0, 25)

In [57]:
## make new integer genre_id and drop string genres
#basic['genre_id'] = basic['genres_split'].map(genre_map)
#df = df.drop(columns='genres_split')

In [58]:
genre_lookup =pd.DataFrame({'genre_name':genre_id_map.keys(),
                            'genre_Id' :genre_id_map.values()})
genre_lookup

    genre_name  genre_Id
0       Action         0
1        Adult         1
2    Adventure         2
3    Animation         3
4    Biography         4
5       Comedy         5
6        Crime         6
7        Drama         7
8       Family         8
9      Fantasy         9
10   Game-Show        10
11     History        11
12      Horror        12
13       Music        13
14     Musical        14
15     Mystery        15
16        News        16
17  Reality-TV        17
18     Romance        18
19      Sci-Fi        19
20       Sport        20
21   Talk-Show        21
22    Thriller        22
23         War        23
24     Western        24

II) Saving the MySQL tables with tconst as the primary key.

In [59]:
basic.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016,NaN,90,Drama,[Drama]
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
4,tt0070596,movie,Socialist Realism,El realismo socialista,0,2023,NaN,78,Drama,[Drama]

In [60]:
basic = basic[['tconst','primaryTitle','startYear','endYear','runtimeMinutes']]
basic.head()

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,NaN,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,NaN,70
2,tt0068865,Lives of Performers,2016,NaN,90
3,tt0069049,The Other Side of the Wind,2018,NaN,122
4,tt0070596,Socialist Realism,2023,NaN,78

## Loading Title Ratings

In [61]:
ratings = pd.read_csv('Data/title_rating.csv.gz')
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      2002
1  tt0000002            5.8       269
2  tt0000005            6.2      2677
3  tt0000006            5.0       183
4  tt0000007            5.4       838

## Loading TMDB API Results

In [62]:
# loading `TMBD Api Result 
tmdb_Api = pd.read_csv('Data/Datatmdb_results_combined.csv.gz')
tmdb_Api.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2620 entries, 0 to 2619
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                2620 non-null   object
 1   adult                  2618 non-null   float64
 2   backdrop_path          1467 non-null   object
 3   belongs_to_collection  212 non-null    object
 4   budget                 2618 non-null   float64
 5   genres                 2618 non-null   object
 6   homepage               172 non-null    object
 7   id                     2618 non-null   float64
 8   original_language      2618 non-null   object
 9   original_title         2618 non-null   object
 10  overview               2566 non-null   object
 11  popularity             2618 non-null   float64
 12  poster_path            2376 non-null   object
 13  production_companies   2618 non-null   object
 14  production_countries   2618 non-null   object
 15  release_date           2595 non-null   object
 16  revenue                2618 non-null   float64
 17  runtime                2618 non-null   float64
 18  spoken_languages       2618 non-null   object
 19  status                 2618 non-null   object
 20  tagline                1129 non-null   object
 21  title                  2618 non-null   object
 22  video                  2618 non-null   float64
 23  vote_average           2618 non-null   float64
 24  vote_count             2618 non-null   float64
 25  certification          815 non-null    object
dtypes: float64(9), object(17)
memory usage: 532.3+ KB

In [63]:
tmdb_Api =tmdb_Api[['imdb_id','budget','revenue','certification']]
tmdb_Api.head()

     imdb_id      budget     revenue certification
0          0         NaN         NaN           NaN
1  tt0113026  10000000.0         0.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694    150000.0  14204632.0            PG

In [64]:
# checking datatype tmdb_Api
tmdb_Api.dtypes

imdb_id           object
budget           float64
revenue          float64
certification     object
dtype: object

In [65]:
# Checking datatype for ratings
ratings.dtypes

tconst            object
averageRating    float64
numVotes           int64
dtype: object

In [66]:
# Checking datatype for basic
basic.dtypes

tconst             object
primaryTitle       object
startYear           int64
endYear           float64
runtimeMinutes      int64
dtype: object

# Creating database

In [67]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

In [68]:
username = "root"
password = "Lwanda09" # (or whatever password you chose during mysql installation)
db_name = "movies"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"

engine = create_engine(connection)
engine

Engine(mysql+pymysql://root:***@localhost/movies)

In [69]:
engine = create_engine(connection)
engine

Engine(mysql+pymysql://root:***@localhost/movies)

In [70]:
# Check if the database exists. If not, create it.
if database_exists(connection) == False:
  create_database(connection)
else:
  print('The database already exists')

The database already exists

In [71]:
basic.head()

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,NaN,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,NaN,70
2,tt0068865,Lives of Performers,2016,NaN,90
3,tt0069049,The Other Side of the Wind,2018,NaN,122
4,tt0070596,Socialist Realism,2023,NaN,78

In [ ]:
basic schema

In [72]:
## load ti
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = basic['tconst'].fillna('').map(len).max()
title_len = basic['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [73]:
# Save to sql with dtype and index=False
basic.to_sql('title_basics',engine,dtype=df_schema,if_exists='replace',index=False)

91453

ratings schema

In [75]:
# creating schema for rating 
key_len = ratings['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schemarating = {
    "tconst": String(key_len+1), 
    'averageRating':Float(),
    'numVotes':Integer()}

In [76]:
# Save to sql with dtype and index=False
ratings.to_sql('title_ratings',engine,dtype=df_schemarating,if_exists='replace',index=False)

512135

tmdb_Api schema

In [77]:
# creating schema for tmdb_Api
key_len = tmdb_Api['imdb_id'].fillna('').map(len).max()
cert_len = tmdb_Api['certification'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "imdb_id": String(key_len+1), 
    "budget": Float(),
    'revenue':Float(),
    'certification':Text(cert_len+1)}

In [79]:
# Save to sql with dtype and index=False
tmdb_Api.to_sql('tmdb_data',engine,dtype=df_schema,if_exists='replace',index=False)

2620

In [81]:
# Checking genre dttype 
genre_lookup.dtypes

genre_name    object
genre_Id       int64
dtype: object

In [84]:
# creating schema for genre
name_len = genre_lookup['genre_name'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schemagenre = {
    "genre_Id": Integer(), 
    'genre_name':Text(name_len+1)}

In [86]:
# Save to sql with dtype and index=False
genre_lookup.to_sql('genra',engine,dtype=df_schemagenre,if_exists='replace',index=False)

25